Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A Set that uses an internal CopyOnWriteArrayList for all of its operations.
zh_cn: 对其所有操作使用内部 CopyOnWriteArrayList 的 Set。

source: A SortedMap extended with navigation methods returning the closest matches for given search targets.
zh_cn: 扩展的 SortedMap，具有了针对给定搜索目标返回最接近匹配项的导航方法。

source: A SortedSet extended with navigation methods reporting closest matches for given search targets.
zh_cn: 扩展的 SortedSet，具有了为给定搜索目标报告最接近匹配项的导航方法。

source: A ThreadPoolExecutor that can additionally schedule commands to run after a given delay, or to execute periodically.
zh_cn: ThreadPoolExecutor，它可另行安排在给定的延迟后运行命令，或者定期执行命令。

source: A BufferedInputStream adds functionality to another input stream-namely, the ability to buffer the input and to support the mark and reset methods.
zh_cn: BufferedInputStream 为另一个输入流添加一些功能，即缓冲输入以及支持 mark 和 reset 方法的能力。

source: A ByteArrayInputStream contains an internal buffer that contains bytes that may be read from the stream.
zh_cn: ByteArrayInputStream 包含一个内部缓冲区，该缓冲区包含从流中读取的字节。

source: A ChoiceFormat allows you to attach a format to a range of numbers.
zh_cn: ChoiceFormat 允许将格式应用到某个范围的数。

source: A Closeable is a source or destination of data that can be closed.
zh_cn: Closeable 是可以关闭的数据源或目标。

source: A CollationKey represents a String under the rules of a specific Collator object.
zh_cn: CollationKey 表示遵守特定 Collator 对象规则的 String。

source: A Field permits widening conversions to occur during a get or set access operation, but throws an IllegalArgumentException if a narrowing conversion would occur.
zh_cn: Array 允许在执行 get 或 set 访问操作期间进行扩展转换，但如果将发生收缩转换，则抛出一个 IllegalArgumentException。

source: A Field provides information about, and dynamic access to, a single field of a class or an interface.
zh_cn: Field 提供有关类或接口的单个字段的信息，以及对它的动态访问权限。

source: A FileInputStream obtains input bytes from a file in a file system.
zh_cn: FileInputStream 从文件系统中的某个文件中获得输入字节。

source: A FilterInputStream contains some other input stream, which it uses as its basic source of data, possibly transforming the data along the way or providing additional functionality.
zh_cn: FilterInputStream 包含其他一些输入流，它将这些流用作其基本数据源，它可以直接传输数据或提供一些额外的功能。

source: A Future represents the result of an asynchronous computation.
zh_cn: Future 表示异步计算的结果。

source: A KeyStore entry that holds a PrivateKey and corresponding certificate chain.
zh_cn: 保存 PrivateKey 和相应证书链的 KeyStore 项。

source: A KeyStore entry that holds a SecretKey.
zh_cn: 保存 SecretKey 的 KeyStore 项。

source: A KeyStore entry that holds a trusted Certificate.
zh_cn: 保存可信的 Certificate 的 KeyStore 项。

source: A Locale object represents a specific geographical, political, or cultural region.
zh_cn: Locale 对象表示了特定的地理、政治和文化地区。

source: A Method permits widening conversions to occur when matching the actual parameters to invoke with the underlying method's formal parameters, but it throws an IllegalArgumentException if a narrowing conversion would occur.
zh_cn: Method 允许在匹配要调用的实参与底层方法的形参时进行扩展转换；但如果要进行收缩转换，则会抛出 IllegalArgumentException。

source: A Method provides information about, and access to, a single method on a class or interface.
zh_cn: Method 提供关于类或接口上单独某个方法（以及如何访问该方法）的信息。

source: A PrintStream adds functionality to another output stream, namely the ability to print representations of various data values conveniently.
zh_cn: PrintStream 为其他输出流添加了功能，使它们能够方便地打印各种数据值表示形式。

source: A PushbackInputStream adds functionality to another input stream, namely the ability to "push back" or "unread" one byte.
zh_cn: PushbackInputStream 为另一个输入流添加性能，即“推回 (push back)”或“取消读取 (unread)”一个字节的能力。

source: A ReadWriteLock maintains a pair of associated locks, one for read-only operations and one for writing.
zh_cn: ReadWriteLock 维护了一对相关的锁，一个用于只读操作，另一个用于写入操作。

source: A SecurityException is raised if flag is true but accessibility of any of the elements of the input array may not be changed (for example, if the element object is a Constructor object for the class Class).
zh_cn: 如果 flag 为 true，但是不能更改输入 array 的任何元素的可访问性（例如，如果元素对象是 Class 类的 Constructor 对象），则会引发 SecurityException。

source: A SecurityException is raised if flag is true but accessibility of this object may not be changed (for example, if this element object is a Constructor object for the class Class).
zh_cn: 如果 flag 为 true，并且不能更改此对象的可访问性（例如，如果此元素对象是 Class 类的 Constructor 对象），则会引发 SecurityException。

source: A SecurityException is raised if this object is a Constructor object for the class java.lang.Class, and flag is true.
zh_cn: 如果此对象是 java.lang.Class 类的 Constructor 对象，并且 flag 为 true，则会引发 SecurityException。

source: A SequenceInputStream represents the logical concatenation of other input streams.
zh_cn: SequenceInputStream 表示其他输入流的逻辑串联。

source: A String represents a string in the UTF-16 format in which supplementary characters are represented by surrogate pairs (see the section Unicode Character Representations in the Character class for more information).
zh_cn: String 表示一个 UTF-16 格式的字符串，其中的增补字符 由代理项对 表示（有关详细信息，请参阅 Character 类中的 Unicode 字符表示形式）。

source: A ThreadPoolExecutor will automatically adjust the pool size (see getPoolSize()) according to the bounds set by corePoolSize (see getCorePoolSize()) and maximumPoolSize (see getMaximumPoolSize()).
zh_cn: ThreadPoolExecutor 将根据 corePoolSize（参见 getCorePoolSize()）和 maximumPoolSize（参见 getMaximumPoolSize()）设置的边界自动调整池大小（参见 getPoolSize()）。

source: A TimeUnit represents time durations at a given unit of granularity and provides utility methods to convert across units, and to perform timing and delay operations in these units.
zh_cn: TimeUnit 表示给定单元粒度的时间段，它提供在这些单元中进行跨单元转换和执行计时及延迟操作的实用工具方法。

source: A boolean value that may be updated atomically.
zh_cn: 可以用原子方式更新的 boolean 值。

source: A char value, therefore, represents Basic Multilingual Plane (BMP) code points, including the surrogate code points, or code units of the UTF-16 encoding.
zh_cn: 所以，char 值表示 Basic Multilingual Plane (BMP) 代码点，其中包括代理项代码点，或 UTF-16 编码的代码单元。

source: A long array in which elements may be updated atomically.
zh_cn: 可以用原子方式更新其元素的 long 数组。

source: A long value that may be updated atomically.
zh_cn: 可以用原子方式更新的 long 值。

source: A Future returns the results of a function, allows determination of whether execution has completed, and provides a means to cancel execution.
zh_cn: Future 返回函数的结果，允许确定执行是否完成，并提供取消执行的方法。

source: A CopyOnWriteArrayList is preferable to a synchronized ArrayList when the expected number of reads and traversals greatly outnumber the number of updates to a list.
zh_cn: 当期望的读数和遍历远远大于列表的更新数时，CopyOnWriteArrayList 优于同步的 ArrayList。

source: A RunnableFuture is a Future that possesses a run method that upon execution, sets its results.
zh_cn: RunnableFuture 是拥有 run 方法的 Future，run 方法执行时将设置其结果。

source: A char value represents a character in the Basic Multilingual Plane (BMP) or a surrogate.
zh_cn: char 值表示 Basic Multilingual Plane (BMP) 或代理项中的一个字符。

source: A false return means only that the operation may be retried if desired, relying on the guarantee that repeated invocation when the variable holds expectedValue and no other thread is also attempting to set the variable will eventually succeed.
zh_cn: 返回 false 仅意味着可以在需要时重新尝试操作，具体取决于重复执行调用的保证，当该变量保持 expectedValue 并且没有其他线程也在尝试设置该变量时，最终将获得成功。

source: A reference object encapsulates a reference to some other object so that the reference itself may be examined and manipulated like any other object.
zh_cn: 引用对象 封装了对另一个对象的引用，这样就可以像其他任何对象一样检查和操作引用自身。

source: A buffer is a container for a fixed amount of data of a specific primitive type.
zh_cn: 缓冲区 是一个固定数据量的指定基本类型的数据容器。

source: A dynamic proxy class (simply referred to as a proxy class below) is a class that implements a list of interfaces specified at runtime when the class is created, with behavior as described below.
zh_cn: 动态代理类（以下简称为代理类）是一个实现在创建类时在运行时指定的接口列表的类，该类具有下面描述的行为。

source: A thread is a thread of execution in a program.
zh_cn: 线程 是程序中的执行线程。

source: A proxy interface is such an interface that is implemented by a proxy class.
zh_cn: 代理接口 是代理类实现的一个接口。

source: A proxy instance is an instance of a proxy class.
zh_cn: 代理实例 是代理类的一个实例。

source: A CharSequence is a readable sequence of char values.
zh_cn: CharSequence 是 char 值的一个可读序列。

source: A Flushable is a destination of data that can be flushed.
zh_cn: Flushable 是可刷新数据的目标地。

source: A Readable is a source of characters.
zh_cn: Readable 是一个字符源。

source: A Comparator that orders String objects as by compareToIgnoreCase.
zh_cn: 一个对 String 对象进行排序的 Comparator，作用与 compareToIgnoreCase 相同。

source: A CookieHandler object provides a callback mechanism to hook up a HTTP state management policy implementation into the HTTP protocol handler.
zh_cn: CookieHandler 对象提供一种回调机制以将 HTTP 状态管理策略实现挂钩到 HTTP 协议处理程序。

source: A CookieStore object represents a storage for cookie.
zh_cn: 表示 cookie 存储区的 CookieStore 对象。

source: A GuardedObject is an object that is used to protect access to another object.
zh_cn: GuardedObject 是一个用来保护对另一个对象的访问的对象。

source: A ProtectionParameter encapsulating a CallbackHandler.
zh_cn: 封装 CallbackHandler 的 ProtectionParameter。

source: A Red-Black tree based NavigableMap implementation.
zh_cn: 基于红黑树（Red-Black tree）的 NavigableMap 实现。

source: A Retention meta-annotation has effect only if the meta-annotated type is used directly for annotation.
zh_cn: 只有元注释类型直接用于注释时，Retention 元注释才有效。

source: A Spliterator specialized for double values.
zh_cn: 一个专用于 double 值的 Spliterator。

source: A Spliterator specialized for int values.
zh_cn: 一个专用于 int 值的 Spliterator。

source: A Spliterator specialized for long values.
zh_cn: 一个专用于 long 值的 Spliterator。

source: A Spliterator specialized for primitive values.
zh_cn: 专门用于基本类型值的 Spliterator。

source: A URL Connection to a Java ARchive (JAR) file or an entry in a JAR file.
zh_cn: 连接到 Java ARchive (JAR) 文件或 JAR 文件中条目的 URL Connection。

source: A URLConnection with support for HTTP-specific features.
zh_cn: 支持 HTTP 特定功能的 URLConnection。

source: A base type for primitive specializations of Iterator.
zh_cn: 基本类型专用的 Iterator。

source: A bounded blocking queue backed by an array.
zh_cn: 一个由数组支持的有界阻塞队列。

source: A buffered character-input stream that keeps track of line numbers.
zh_cn: 跟踪行号的缓冲字符输入流。

source: A byte buffer can be allocated as a direct buffer, in which case the Java virtual machine will make a best effort to perform native I/O operations directly upon it.
zh_cn: 可以将字节缓冲区分配为一个 直接 缓冲区，在这种情况下，Java 虚拟机将最大限度地直接在缓冲区上执行本机 I/O 操作。

source: A byte buffer can be created by mapping a region of a file directly into memory, in which case a few additional file-related operations defined in the MappedByteBuffer class are available.
zh_cn: 可以通过 mapping 将文件区域直接包装到内存中来创建字节缓冲区，在这种情况下，可以使用 MappedByteBuffer 类中定义的几个其他文件相关的操作。

source: A byte buffer mapped to a file
zh_cn: 映射到文件的字节缓冲区

source: A byte buffer provides access to its content as either a heterogeneous or homogeneous sequence of binary data of any non-boolean primitive type, in either big-endian or little-endian byte order.
zh_cn: 字节缓冲区提供了对其内容的访问（其内容作为任何非布尔基本类型的异类或同类 二进制数据 序列），访问要么是以 big-endian 字节顺序进行，要么是以 little-endian 字节顺序进行。

source: A byte buffer.
zh_cn: 字节缓冲区。

source: A call to start on a thread happens-before any action in the started thread.
zh_cn: 在线程上调用 starthappen-before 已启动的线程中的任何线程。

source: A cancellable asynchronous computation.
zh_cn: 可取消的异步计算。

source: A capability-based lock with three modes for controlling read/write access.
zh_cn: 一种基于功能的锁，有三种控制读写访问的模式。

source: A cause can be associated with a throwable in two ways: via a constructor that takes the cause as an argument, or via the initCause(Throwable) method.
zh_cn: Cause 可以通过两种方式与 throwable 关联起来：通过一个将 cause 看作参数的构造方法；或者通过 initCause(Throwable) 方法。

source: A char buffer.
zh_cn: 字符缓冲区。

source: A character is contained by at most one Unicode block.
zh_cn: 一个字符至多可以包含在一个 Unicode 块中。

source: A character stream that collects its output in a string buffer, which can then be used to construct a string.
zh_cn: 一个字符流，可以用其回收在字符串缓冲区中的输出来构造字符串。

source: A character stream whose source is a string.
zh_cn: 其源为一个字符串的字符流。

source: A character-stream reader that allows characters to be pushed back into the stream.
zh_cn: 允许将字符推回到流的字符流 reader。

source: A class can implement the Observer interface when it wants to be informed of changes in observable objects.
zh_cn: 一个可在观察者要得到 observable 对象更改通知时可实现 Observer 接口的类。

source: A class implements the Cloneable interface to indicate to the clone() method that it is legal for that method to make a field-for-field copy of instances of that class.
zh_cn: 此类实现了 Cloneable 接口，以指示 clone() 方法可以合法地对该类实例进行按字段复制。

source: A class loader is an object that is responsible for loading classes.
zh_cn: 类加载器是负责加载类的对象。

source: A class that implements Runnable can run without subclassing Thread by instantiating a Thread instance and passing itself in as the target.
zh_cn: 通过实例化某个 Thread 实例并将自身作为运行目标，就可以运行实现 Runnable 的类而无需创建 Thread 的子类。

source: A class that represents an immutable universally unique identifier (UUID).
zh_cn: 表示通用唯一标识符 (UUID) 的类。

source: A collection designed for holding elements prior to processing.
zh_cn: 在处理元素前用于保存元素的 collection。

source: A collection that contains no duplicate elements.
zh_cn: 一个不包含重复元素的 collection。

source: A common interface for all entities that declare type variables.
zh_cn: 声明类型变量的所有实体的公共接口。

source: A comparison function, which imposes a total ordering on some collection of objects.
zh_cn: 强行对某个对象 collection 进行 整体排序 的比较函数。

source: A concurrent collection is thread-safe, but not governed by a single exclusion lock.
zh_cn: 并发 collection 是线程安全的，但是不受单个排他锁的管理。

source: A constant holding a Not-a-Number (NaN) value of type double.
zh_cn: 保存 double 类型的 NaN 值的常量。

source: A constant holding a Not-a-Number (NaN) value of type float.
zh_cn: 保存 float 类型的非数字 (NaN) 值的常量。

source: A constant holding the largest positive finite value of type double, (2-2-52)·21023.
zh_cn: 保存 double 类型的最大正有限值的常量，最大正有限值为 (2-2-52)·21023。

source: A constant holding the largest positive finite value of type float, (2-2-23)·2127.
zh_cn: 保存 float 类型的最大正有限值的常量，即 (2-2-23)·2127。

source: A constant holding the maximum value a byte can have, 27-1.
zh_cn: 一个常量，保存 byte 类型可取的最大值，即 27-1。

source: A constant holding the maximum value a long can have, 263-1.
zh_cn: 保持 long 类型的最大值的常量，该值为 263-1。

source: A constant holding the maximum value a short can have, 215-1.
zh_cn: 保存 short 可取的最大值的常量，最大值为 215-1。

source: A constant holding the maximum value an int can have, 231-1.
zh_cn: 值为 231－1 的常量，它表示 int 类型能够表示的最大值。

source: A constant holding the minimum value a byte can have, -27.
zh_cn: 一个常量，保存 byte 类型可取的最小值，即 -27。

source: A constant holding the minimum value a long can have, -263.
zh_cn: 保持 long 类型的最小值的常量，该值为 -263。

source: A constant holding the minimum value a short can have, -215.
zh_cn: 保存 short 可取的最小值的常量，最小值为 -215。

source: A constant holding the minimum value an int can have, -231.
zh_cn: 值为 －231 的常量，它表示 int 类型能够表示的最小值。

source: A constant holding the negative infinity of type double.
zh_cn: 保存 double 类型的负无穷大值的常量。

source: A constant holding the negative infinity of type float.
zh_cn: 保存 float 类型的负无穷大值的常量。

source: A constant holding the positive infinity of type double.
zh_cn: 保存 double 类型的正无穷大值的常量。

source: A constant holding the positive infinity of type float.
zh_cn: 保存 float 类型的正无穷大值的常量。

source: A constant holding the smallest positive nonzero value of type double, 2-1074.
zh_cn: 保存 double 类型的最小正非零值的常量，最小正非零值为 2-1074。

source: A constant holding the smallest positive nonzero value of type float, 2-149.
zh_cn: 保存 float 类型数据的最小正非零值的常量，即 2-149。

source: A constant holding the smallest positive normal value of type double, 2-1022.
zh_cn: 保存 double 类型的最小正标准值的常量，最小正标准值为 2-1022。

source: A constant holding the smallest positive normal value of type float, 2-126.
zh_cn: 保存 float 类型数据的最小正标准值的常量，即 2-126。

source: A container for data of a specific primitive type.
zh_cn: 一个用于特定基本类型数据的容器。

source: A container object which may or may not contain a double value.
zh_cn: 可能包含也可能不包含 double 值的容器对象。

source: A container object which may or may not contain a int value.
zh_cn: 可能包含也可能不包含 int 值的容器对象。

source: A container object which may or may not contain a long value.
zh_cn: 可能包含也可能不包含 long 值的容器对象。

source: A container object which may or may not contain a non-null value.
zh_cn: 可能包含也可能不包含非空值的容器对象。

source: A correctly rounded method is generally the best a floating-point approximation can be; however, it is impractical for many floating-point methods to be correctly rounded.
zh_cn: 一个正确舍入的方法通常能得到最佳的浮点近似值；然而，对于许多浮点方法，进行正确舍入有些不切实际。

source: A counting semaphore.
zh_cn: 一个计数信号量。

source: A data input stream lets an application read primitive Java data types from an underlying input stream in a machine-independent way.
zh_cn: 数据输入流允许应用程序以与机器无关方式从底层输入流中读取基本 Java 数据类型。

source: A data output stream lets an application write primitive Java data types to an output stream in a portable way.
zh_cn: 数据输出流允许应用程序以适当方式将基本 Java 数据类型写入输出流中。

source: A delayed result-bearing action that can be cancelled.
zh_cn: 一个延迟的、结果可接受的操作，可将其取消。

source: A description of a Serializable field from a Serializable class.
zh_cn: Serializable 类中 Serializable 字段的描述。

source: A description of a to-be-instantiated KeyStore object.
zh_cn: 将被实例化的 KeyStore 对象的描述。

source: A direct byte buffer whose content is a memory-mapped region of a file.
zh_cn: 直接字节缓冲区，其内容是文件的内存映射区域。

source: A double buffer.
zh_cn: double 缓冲区。

source: A facility for threads to schedule tasks for future execution in a background thread.
zh_cn: 一种工具，线程用其安排以后在后台线程中执行的任务。

source: A family of character subsets representing the character blocks in the Unicode specification.
zh_cn: 表示 Unicode 规范中字符块的一系列字符子集。

source: A family of character subsets representing the character scripts defined in the Unicode Standard Annex #24: Script Names.
zh_cn: 表示 Unicode Standard Annex #24: Script Names 中定义的字符块的一系列字符子集。

source: A file output stream is an output stream for writing data to a File or to a FileDescriptor.
zh_cn: 文件输出流是用于将数据写入 File 或 FileDescriptor 的输出流。

source: A filter for abstract pathnames.
zh_cn: 用于抽象路径名的过滤器。

source: A float buffer.
zh_cn: float 缓冲区。

source: A generator of uniform pseudorandom values applicable for use in (among other contexts) isolated parallel computations that may generate subtasks.
zh_cn: 一种均匀伪随机值的生成器，适用于(在其它上下文中)可能生成子任务的独立并行计算。

source: A handler for rejected tasks that discards the oldest unhandled request and then retries execute, unless the executor is shut down, in which case the task is discarded.
zh_cn: 用于被拒绝任务的处理程序，它放弃最旧的未处理请求，然后重试 execute；如果执行程序已关闭，则会丢弃该任务。

source: A handler for rejected tasks that runs the rejected task directly in the calling thread of the execute method, unless the executor has been shut down, in which case the task is discarded.
zh_cn: 用于被拒绝任务的处理程序，它直接在 execute 方法的调用线程中运行被拒绝的任务；如果执行程序已关闭，则会丢弃该任务。

source: A handler for rejected tasks that silently discards the rejected task.
zh_cn: 用于被拒绝任务的处理程序，默认情况下它将丢弃被拒绝的任务。

source: A handler for rejected tasks that throws a RejectedExecutionException.
zh_cn: 用于被拒绝任务的处理程序，它将抛出 RejectedExecutionException.

source: A handler for tasks that cannot be executed by a ThreadPoolExecutor.
zh_cn: 无法由 ThreadPoolExecutor 执行的任务的处理程序。

source: A hash table supporting full concurrency of retrievals and high expected concurrency for updates.
zh_cn: 支持获取的完全并发和更新的高期望并发的哈希表。

source: A hint to the scheduler that the current thread is willing to yield its current use of a processor.
zh_cn: 向调度程序提示当前线程愿意放弃当前对处理器的使用。

source: A linear collection that supports element insertion and removal at both ends.
zh_cn: 一个线性 collection，支持在两端插入和移除元素。

source: A long buffer.
zh_cn: long 缓冲区。

source: A map entry (key-value pair).
zh_cn: 映射项（键-值对）。

source: A marker interface for KeyStore load and store parameters.
zh_cn: 用于 KeyStore load 和 store 参数的标记接口。

source: A marker interface for KeyStore entry types.
zh_cn: 用于 KeyStore 项类型的标记接口。

source: A marker interface for keystore protection parameters.
zh_cn: 用于 keystore 保护参数的标记接口。

source: A marker interface identifying asynchronous tasks produced by async methods.
zh_cn: 标识由 async 方法产生的异步任务的标记接口。

source: A method invocation on a proxy instance through one of its proxy interfaces will be dispatched to the invoke method of the instance's invocation handler, passing the proxy instance, a java.lang.reflect.Method object identifying the method that was invoked, and an array of type Object containing the arguments.
zh_cn: 通过其中一个代理接口的代理实例上的方法调用将被指派到实例的调用处理程序的 Invoke 方法，并传递代理实例、识别调用方法的 java.lang.reflect.Method 对象以及包含参数的 Object 类型的数组。

source: A method is not required to declare in its throws clause any subclasses of Error that might be thrown during the execution of the method but not caught, since these errors are abnormal conditions that should never occur.
zh_cn: 在执行该方法期间，无需在其 throws 子句中声明可能抛出但是未能捕获的 Error 的任何子类，因为这些错误可能是再也不会发生的异常条件。

source: A minimal set of system dependent environment variables may be required to start a process on some operating systems.
zh_cn: 在某些操作系统上启动进程可能需要一组最小的系统相关环境变量。

source: A mix-in style interface for marking objects that should be acted upon after a given delay.
zh_cn: 一种混合风格的接口，用来标记那些应该在给定延迟时间之后执行的对象。

source: A mutable sequence of characters.
zh_cn: 一个可变的字符序列。

source: A new String object is allocated and initialized to contain the character sequence currently represented by this object.
zh_cn: 将分配一个新的 String 对象，并将它初始化，以包含当前由此对象表示的字符串序列。

source: A new certificate handling package is created in the Java platform.
zh_cn: 在 Java 平台中创建了新的证书处理包。

source: A newly-created object is strongly reachable by the thread that created it.
zh_cn: 新创建的对象对于创建它的线程而言是强可到达对象。

source: A number of classes in the java.net package do provide for a much higher level of abstraction and allow for easy access to resources on the network.
zh_cn: java.net 包中的许多类可以提供更加高级的抽象，允许方便地访问网络上的资源。

source: A parameterized type is created the first time it is needed by a reflective method, as specified in this package.
zh_cn: 参数化类型在反射方法首次需要时创建（在此包中指定）。

source: A password-based implementation of ProtectionParameter.
zh_cn: ProtectionParameter 的一个基于密码的实现。

source: A piped input stream should be connected to a piped output stream; the piped input stream then provides whatever data bytes are written to the piped output stream.
zh_cn: 管道输入流应该连接到管道输出流；管道输入流提供要写入管道输出流的所有数据字节。

source: A piped output stream can be connected to a piped input stream to create a communications pipe.
zh_cn: 可以将管道输出流连接到管道输入流来创建通信管道。

source: A pool that is no longer referenced in a program AND has no remaining threads will be shutdown automatically.
zh_cn: 程序 AND 不再引用的池没有剩余线程会自动 shutdown。

source: A private key.
zh_cn: 私钥。

source: A program element annotated @Deprecated is one that programmers are discouraged from using, typically because it is dangerous, or because a better alternative exists.
zh_cn: 用 @Deprecated 注释的程序元素，不鼓励程序员使用这样的元素，通常是因为它很危险或存在更好的选择。

source: A program element type.
zh_cn: 程序元素类型。

source: A program may also arrange to be notified some time after the collector has determined that the reachability of a given object has changed.
zh_cn: 程序还可以安排在回收器确定某一给定对象的可到达性已经更改之后的某个时间得到通知。

source: A program may further subclass these subclasses, adding whatever fields and methods are required for its purposes, or it may use these subclasses without change.
zh_cn: 通过添加任何所需的字段和方法，程序可以为这些子类进一步创建子类，或者可以不加更改地使用这些子类。

source: A program may request to be notified of changes in an object's reachability by registering an appropriate reference object with a reference queue at the time the reference object is created.
zh_cn: 在创建引用对象时，通过向引用队列 注册 一个适当的 引用对象，程序可以请求在对象可到达性更改时获得通知。

source: A program may use a reference object to maintain a reference to some other object in such a way that the latter object may still be reclaimed by the collector.
zh_cn: 程序可以使用一个引用对象来维持对另外某一对象的引用，所采用的方式是使后者仍然可以被回收器回收。
